Extensions/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВестиРасчетыПоДоговорам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоДокументам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетОплатыПоСчетам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателем</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПокупателяРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщикуРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателемРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщикомРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоговорПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eb5f6678-4158-4ee5-8fcb-5d1c6c1cc651">
    <name>Регион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7122d071-c81b-484d-974a-5395bce9e1e5">
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6a614d71-f1bf-4633-927f-fd1ab375a540">
    <name>ВидКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5466e60d-3f3b-4854-8bc4-fe713678faf2">
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="458d6d7c-5c88-45b8-888f-4d270608a318">
    <name>ПересчитатьКоличество</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbfd1e4e-302d-4158-a36e-7de2ee52275f">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83abc3c8-5d30-4200-9b3c-c098e93d9dd4">
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec4ed95c-1f1d-4935-9318-2b9974ec88f0">
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a66e61d-1e1f-42eb-84c7-96c67491221a">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c668625-cb13-4bde-bae0-9759ff1df43c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="854ddbe5-0bf2-4200-99b7-e7f1ddfc9a9f">
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f2371825-a31d-415b-8866-8e1c4f108e47">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="adb6110c-e022-4572-88ef-65dd4952fcbe">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="578aaecc-aed2-4ef8-88f9-128a6e803783">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="98a3a104-c023-42c2-a3c0-d21a8e8f0304">
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41b066d1-5b7a-43b3-a41f-e1454f08da07">
    <name>ДокументУдостоверяющийЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0565ba91-4e56-4a4c-9e27-ac8d883651da">
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41d21375-fd54-4079-bbc2-300777a9d765">
    <name>ЯвляетсяНеРезидентом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="659f6c35-8c2c-4875-b5cb-8ac72af650b4">
    <name>ВидГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2539e2b6-2cb7-41c5-8e5d-9974cf014a38">
    <name>КодГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf75569-7170-46ea-98a4-29bb3969c1c2">
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1fc7846e-c92e-4119-9b0b-ab25f1a6447b">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7abf59d6-06a4-45fa-b1d0-bf469f93bc01">
    <name>ДатаСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="847a0096-60ac-48f8-8aca-cbe9c6b9d831">
    <name>ВидВыдачиНДФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dcd64d96-d03a-453f-9b38-c9fb1774f698">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bffaa0c1-d082-4cef-bb60-629a5f7c83bf">
    <name>ИсточникПривлеченияПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="150ea83f-859a-4383-a7e2-add9615c515d">
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="76824394-0205-4f78-811e-ec0d061e9082">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80bc655a-d926-42fc-b027-e9e0c125aff4">
    <name>СтатьяДДСПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4bd3ecda-70e1-4a95-8164-e47939295eac">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cb84cb-9e1e-453c-8713-90ca48083f56">
    <name>AzRyОрганизацияПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="97d34945-57be-4c10-8ebe-f99f645f7f21">
    <name>ТранспортныеСредства</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4ba6fe2e-1665-4ebc-a9ca-2fc497fa8096">
      <name>ТранпсортноеСедство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="bdad0c95-0a6d-4755-a02b-e7b01def2cc9">
    <name>AzRyKYCАнкетаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="db6504ac-39b9-4ffe-b0cb-6e2ddd912856">
      <name>Вопрос</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="969c130d-b763-4d98-b044-7238fd2376c3">
      <name>Ответ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="82020433-f8a7-4e23-b34a-13fe6dd56f97">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>250</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="fa81535a-911f-42fb-92a8-88eb7a2103db">
    <name>AzRyОценкаРискаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f3b8cc7b-e7df-41a9-8a4a-c3d0ae1cae2b">
      <name>Вопрос</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b5a4c161-918e-4341-ae1c-a9c60289f4b4">
      <name>Ответ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b5f0385a-e18f-49ac-b01f-ac85c3a27a23">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>250</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="5ab7326e-1d26-42b8-84ec-ce160831942c">
    <name>AzRyРискМатрицаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7aeab778-b059-411e-8171-c588b1c39063">
      <name>ФакторРиска</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e96ddf40-07c2-4d7b-a231-df498affa9ef">
      <name>ВероятностьРиска</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4a3c4948-8048-429d-b0f9-ce88f0c2c947">
      <name>УровеньРиска</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e0ad8fa9-340f-4db3-a396-99b41e6da556">
      <name>МитигирующиеМеры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Extensions/src/Catalogs/Контрагенты/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура РасшAzRy_ПередЗаписью(Отказ)
	
	Если Не ЭтоОрганизацияAzRyPay() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеKYCТаблиц() Тогда
		Сообщить("KYC პასუხების შევსება აუცილებელია.", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаKYC

Функция ПроверитьЗаполнениеKYCТаблиц()
	
	Если Не ПроверитьОтветыВТаблице(AzRyKYCАнкетаКлиента, "Ответ") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПроверитьОтветыВТаблице(AzRyОценкаРискаКлиента, "Ответ") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПроверитьРискМатрицу() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьОтветыВТаблице(Таблица, ИмяРеквизита)
	
	Для Каждого ТекСтрока Из Таблица Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока[ИмяРеквизита]) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьРискМатрицу()
	
	Для Каждого ТекСтрока Из AzRyРискМатрицаКлиента Цикл
		
		Если Не ЗначениеЗаполнено(ТекСтрока.ВероятностьРиска)
			Или Не ЗначениеЗаполнено(ТекСтрока.УровеньРиска)
			Или Не ЗначениеЗаполнено(ТекСтрока.МитигирующиеМеры) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеФункции

Функция ЭтоОрганизацияAzRyPay()
	
	Возврат AzRyОрганизацияПоУмолчанию.Организация = Константы.AzRyОрганизацияAzRyPay.Получить();
	
КонецФункции

#КонецОбласти
